RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal.h
/**
  ******************************************************************************
  * @file    stm32h7rsxx_hal.h
  * @author  MCD Application Team
  * @brief   This file contains all the functions prototypes for the HAL
  *          module driver.
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32H7RSxx_HAL_H
#define STM32H7RSxx_HAL_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7rsxx_hal_conf.h"

/** @addtogroup STM32H7RSxx_HAL_Driver
  * @{
  */

/** @addtogroup HAL
  * @{
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup HAL_TICK_FREQ Tick Frequency
  * @{
  */
/**
  * @brief  HAL Tick frequency
  */
typedef enum
{
  HAL_TICK_FREQ_10HZ         = 100U,
  HAL_TICK_FREQ_100HZ        = 10U,
  HAL_TICK_FREQ_1KHZ         = 1U,
  HAL_TICK_FREQ_DEFAULT      = HAL_TICK_FREQ_1KHZ
} HAL_TickFreqTypeDef;
/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup REV_ID device revision ID
  * @{
  */
#define REV_ID_A 0x1003U  /*!< STM32H7Rx/Sx rev.A */
/**
  * @}
  */

/** @defgroup HAL_Exported_Constants HAL Exported Constants
  * @{
  */
/**
  * @brief STM32H7RSxx HAL Driver version number
  */
#define STM32H7RSXX_HAL_VERSION_MAIN   (0x01U) /*!< [31:24] main version */
#define STM32H7RSXX_HAL_VERSION_SUB1   (0x00U) /*!< [23:16] sub1 version */
#define STM32H7RSXX_HAL_VERSION_SUB2   (0x00U) /*!< [15:8]  sub2 version */
#define STM32H7RSXX_HAL_VERSION_RC     (0x00U) /*!< [7:0]  release candidate */
#define STM32H7RSXX_HAL_VERSION        ((STM32H7RSXX_HAL_VERSION_MAIN  << 24U)\
                                        |(STM32H7RSXX_HAL_VERSION_SUB1 << 16U)\
                                        |(STM32H7RSXX_HAL_VERSION_SUB2 << 8U )\
                                        |(STM32H7RSXX_HAL_VERSION_RC))
/**
  * @}
  */

/** @defgroup SBS_Exported_Constants SBS Exported Constants
  * @{
  */

/** @defgroup SBS_HDPL_Value HDPL Value
  * @{
  */
#define SBS_HDPL_VALUE_0               0x000000B4U               /*!< Hide protection level 0 */
#define SBS_HDPL_VALUE_1               0x00000051U               /*!< Hide protection level 1 */
#define SBS_HDPL_VALUE_2               0x0000008AU               /*!< Hide protection level 2 */
#define SBS_HDPL_VALUE_3               0x0000006FU               /*!< Hide protection level 3 */
/**
  * @}
  */

/** @defgroup SBS_Timer_Break_Inputs Timer Break Inputs
  * @{
  */
#define SBS_TIMER_BREAK_LOCK_PVD       SBS_BKLOCKR_PVD_BL        /*!< PVD break lock */
#define SBS_TIMER_BREAK_LOCK_FLASH     SBS_BKLOCKR_FLASHECC_BL   /*!< FLASH ECC error break lock */
#define SBS_TIMER_BREAK_LOCK_CORE      SBS_BKLOCKR_CM7LCKUP_BL   /*!< Cortex-M7 lockup break lock */
#define SBS_TIMER_BREAK_LOCK_BKPRAM    SBS_BKLOCKR_BKRAMECC_BL   /*!< Backup RAM ECC error break lock */
#define SBS_TIMER_BREAK_LOCK_DTCM      SBS_BKLOCKR_DTCMECC_BL    /*!< DTCM ECC error break lock */
#define SBS_TIMER_BREAK_LOCK_ITCM      SBS_BKLOCKR_ITCMECC_BL    /*!< ITCM ECC error break lock */
#define SBS_TIMER_BREAK_LOCK_AXISRAM3  SBS_BKLOCKR_ARAM3ECC_BL   /*!< AXISRAM3 ECC error break lock */
#define SBS_TIMER_BREAK_LOCK_AXISRAM1  SBS_BKLOCKR_ARAM1ECC_BL   /*!< AXISRAM1 ECC error break lock */
/**
  * @}
  */

/** @defgroup SBS_FPU_Interrupts FPU Interrupts
  * @{
  */
#define SBS_IT_FPU_IOC                 SBS_FPUIMR_FPU_IE_0       /*!< Floating Point Unit Invalid operation Interrupt */
#define SBS_IT_FPU_DZC                 SBS_FPUIMR_FPU_IE_1       /*!< Floating Point Unit Divide-by-zero Interrupt */
#define SBS_IT_FPU_UFC                 SBS_FPUIMR_FPU_IE_2       /*!< Floating Point Unit Underflow Interrupt */
#define SBS_IT_FPU_OFC                 SBS_FPUIMR_FPU_IE_3       /*!< Floating Point Unit Overflow Interrupt */
#define SBS_IT_FPU_IDC                 SBS_FPUIMR_FPU_IE_4       /*!< Floating Point Unit Input denormal Interrupt */
#define SBS_IT_FPU_IXC                 SBS_FPUIMR_FPU_IE_5       /*!< Floating Point Unit Inexact Interrupt */
/**
  * @}
  */

/** @defgroup SBS_Compensation_Cell_Selection Compensation Cell Selection
  * @{
  */
#define SBS_IO_ANALOG_CELL             SBS_CCCSR_COMP_EN         /*!< Compensation cell for the I/O analog switches */
#define SBS_IO_XSPI1_CELL              SBS_CCCSR_XSPI1_COMP_EN   /*!< Compensation cell for the I/O of the XSPI1 */
#define SBS_IO_XSPI2_CELL              SBS_CCCSR_XSPI2_COMP_EN   /*!< Compensation cell for the I/O of the XSPI2 */
/**
  * @}
  */

/** @defgroup SBS_Compensation_Cell_Ready_Selection Compensation Cell Ready Selection
  * @{
  */
#define SBS_IO_ANALOG_CELL_READY       SBS_CCCSR_COMP_RDY        /*!< Ready flag of compensation cell for the I/O analog switches */
#define SBS_IO_XSPI1_CELL_READY        SBS_CCCSR_XSPI1_COMP_RDY  /*!< Ready flag of compensation cell for the I/O of the XSPI1 */
#define SBS_IO_XSPI2_CELL_READY        SBS_CCCSR_XSPI2_COMP_RDY  /*!< Ready flag of compensation cell for the I/O of the XSPI2 */
/**
  * @}
  */

/** @defgroup SBS_IO_Compensation_Code_Config IO Compensation Code config
  * @{
  */
#define SBS_IO_CELL_CODE               0UL                       /*!< Code from the cell */
#define SBS_IO_REGISTER_CODE           1UL                       /*!< Code from the values in the cell code register */
/**
  * @}
  */

/** @defgroup SBS_IO_HSLV_Selection IO High Speed at Low Voltage Selection
  * @{
  */
#define SBS_IO_ANALOG_HSLV             SBS_CCCSR_IOHSLV          /*!< High speed at low voltage for the I/O analog switches */
#define SBS_IO_XSPI1_HSLV              SBS_CCCSR_XSPI1_IOHSLV    /*!< High speed at low voltage for the I/O of the XSPI1 */
#define SBS_IO_XSPI2_HSLV              SBS_CCCSR_XSPI2_IOHSLV    /*!< High speed at low voltage for the I/O of the XSPI2 */
/**
  * @}
  */

/** @defgroup SBS_Ethernet_PHY_Config Ethernet PHY config
  * @{
  */
#define SBS_ETHERNET_PHY_GMII_OR_MII    0U                       /*!< GMII or MII */
#define SBS_ETHERNET_PHY_RMII           SBS_PMCR_ETH_PHYSEL_2    /*!< RMII */
/**
  * @}
  */

