RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal.h
/** @defgroup SBS_ECC_AXISRAM_WS_Config ECC AXISRAMs Wait State when ECC=0 config
  * @{
  */
#define SBS_AXISRAM_WS_0               0U                         /*!< 0 Wait state */
#define SBS_AXISRAM_WS_1               SBS_PMCR_AXISRAM_WS        /*!< 1 Wait state */
/**
  * @}
  */

/** @defgroup SBS_EXTI_Port EXTI Port configuration
  * @{
  */
#define SBS_EXTI_PIN_PORTA             0x00UL                     /*!< Port A pin input of EXTI event detection */
#define SBS_EXTI_PIN_PORTB             0x01UL                     /*!< Port B pin input of EXTI event detection */
#define SBS_EXTI_PIN_PORTC             0x02UL                     /*!< Port C pin input of EXTI event detection */
#define SBS_EXTI_PIN_PORTD             0x03UL                     /*!< Port D pin input of EXTI event detection */
#define SBS_EXTI_PIN_PORTE             0x04UL                     /*!< Port E pin input of EXTI event detection */
#define SBS_EXTI_PIN_PORTF             0x05UL                     /*!< Port F pin input of EXTI event detection */
#define SBS_EXTI_PIN_PORTG             0x06UL                     /*!< Port G pin input of EXTI event detection */
#define SBS_EXTI_PIN_PORTH             0x07UL                     /*!< Port H pin input of EXTI event detection */
#define SBS_EXTI_PIN_PORTM             0x0CUL                     /*!< Port M pin input of EXTI event detection */
#define SBS_EXTI_PIN_PORTN             0x0DUL                     /*!< Port N pin input of EXTI event detection */
#define SBS_EXTI_PIN_PORTO             0x0EUL                     /*!< Port O pin input of EXTI event detection */
#define SBS_EXTI_PIN_PORTP             0x0FUL                     /*!< Port P pin input of EXTI event detection */
/**
  * @}
  */

/** @defgroup AXIM_Exported_Constants AXIM Exported Constants
  * @{
  */

/** @defgroup AXIM_ASIB_READ_ISSUING_CAP AXIM ASIBs Read Issuing Capability
  * @{
  */
#define AXIM_ASIB_READ_ISS_NORMAL       0U                         /*!< Normal issuing capability */
#define AXIM_ASIB_READ_ISS_FORCE_TO_1   AXIM_ASIB_FNMOD_READ_ISS   /*!< Force issuing capability to 1 */
/**
  * @}
  */

/** @defgroup AXIM_ASIB_WRITE_ISSUING_CAP AXIM ASIBs Write Issuing Capability
  * @{
  */
#define AXIM_ASIB_WRITE_ISS_NORMAL      0U                          /*!< Normal issuing capability */
#define AXIM_ASIB_WRITE_ISS_FORCE_TO_1  AXIM_ASIB_FNMOD_WRITE_ISS   /*!< Force issuing capability to 1 */
/**
  * @}
  */

/** @defgroup AXIM_AMIB_READ_ISSUING_CAP AXIM AMIBs Read Issuing Capability
  * @{
  */
#define AXIM_AMIB_READ_ISS_NORMAL       0U                         /*!< Normal issuing capability */
#define AXIM_AMIB_READ_ISS_FORCE_TO_1   AXIM_AMIB_FNMOD_READ_ISS   /*!< Force issuing capability to 1 */
/**
  * @}
  */

/** @defgroup AXIM_AMIB_WRITE_ISSUING_CAP AXIM AMIBs Write Issuing Capability
  * @{
  */
#define AXIM_AMIB_WRITE_ISS_NORMAL      0U                          /*!< Normal issuing capability */
#define AXIM_AMIB_WRITE_ISS_FORCE_TO_1  AXIM_AMIB_FNMOD_WRITE_ISS   /*!< Force issuing capability to 1 */
/**
  * @}
  */

/** @defgroup AXIM_AMIB_READ_ISSUING_BM_CAP AXIM AMIBs Read Issuing Bus Matrix Capability
  * @{
  */
#define AXIM_AMIB_READ_ISS_BM_NORMAL       0U                         /*!< Normal issuing capability */
#define AXIM_AMIB_READ_ISS_BM_FORCE_TO_1   AXIM_AMIB_FNMOD_READ_ISS   /*!< Force issuing capability to 1 */
/**
  * @}
  */

/** @defgroup AXIM_AMIB_WRITE_ISSUING_BM_CAP AXIM AMIBs Write Issuing Bus Matrix Capability
  * @{
  */
#define AXIM_AMIB_WRITE_ISS_BM_NORMAL      0U                          /*!< Normal issuing capability */
#define AXIM_AMIB_WRITE_ISS_BM_FORCE_TO_1  AXIM_AMIB_FNMOD_WRITE_ISS   /*!< Force issuing capability to 1 */
/**
  * @}
  */
/**
  * @}
  */

/* Exported macros -----------------------------------------------------------*/

/** @defgroup DBGMCU_Exported_Macros DBGMCU Exported Macros
  * @{
  */

/** @brief  Freeze/Unfreeze Peripherals in Debug mode
  */
#define __HAL_DBGMCU_FREEZE_GPDMA0()         SET_BIT(DBGMCU->AHB1FZR, DBGMCU_AHB1FZR_GPDMA_0)
#define __HAL_DBGMCU_UNFREEZE_GPDMA0()       CLEAR_BIT(DBGMCU->AHB1FZR, DBGMCU_AHB1FZR_GPDMA_0)

#define __HAL_DBGMCU_FREEZE_GPDMA1()         SET_BIT(DBGMCU->AHB1FZR, DBGMCU_AHB1FZR_GPDMA_1)
#define __HAL_DBGMCU_UNFREEZE_GPDMA1()       CLEAR_BIT(DBGMCU->AHB1FZR, DBGMCU_AHB1FZR_GPDMA_1)

#define __HAL_DBGMCU_FREEZE_GPDMA2()         SET_BIT(DBGMCU->AHB1FZR, DBGMCU_AHB1FZR_GPDMA_2)
#define __HAL_DBGMCU_UNFREEZE_GPDMA2()       CLEAR_BIT(DBGMCU->AHB1FZR, DBGMCU_AHB1FZR_GPDMA_2)

#define __HAL_DBGMCU_FREEZE_GPDMA3()         SET_BIT(DBGMCU->AHB1FZR, DBGMCU_AHB1FZR_GPDMA_3)
#define __HAL_DBGMCU_UNFREEZE_GPDMA3()       CLEAR_BIT(DBGMCU->AHB1FZR, DBGMCU_AHB1FZR_GPDMA_3)

#define __HAL_DBGMCU_FREEZE_GPDMA4()         SET_BIT(DBGMCU->AHB1FZR, DBGMCU_AHB1FZR_GPDMA_4)
#define __HAL_DBGMCU_UNFREEZE_GPDMA4()       CLEAR_BIT(DBGMCU->AHB1FZR, DBGMCU_AHB1FZR_GPDMA_4)

#define __HAL_DBGMCU_FREEZE_GPDMA5()         SET_BIT(DBGMCU->AHB1FZR, DBGMCU_AHB1FZR_GPDMA_5)
#define __HAL_DBGMCU_UNFREEZE_GPDMA5()       CLEAR_BIT(DBGMCU->AHB1FZR, DBGMCU_AHB1FZR_GPDMA_5)

#define __HAL_DBGMCU_FREEZE_GPDMA6()         SET_BIT(DBGMCU->AHB1FZR, DBGMCU_AHB1FZR_GPDMA_6)
#define __HAL_DBGMCU_UNFREEZE_GPDMA6()       CLEAR_BIT(DBGMCU->AHB1FZR, DBGMCU_AHB1FZR_GPDMA_6)

#define __HAL_DBGMCU_FREEZE_GPDMA7()         SET_BIT(DBGMCU->AHB1FZR, DBGMCU_AHB1FZR_GPDMA_7)
#define __HAL_DBGMCU_UNFREEZE_GPDMA7()       CLEAR_BIT(DBGMCU->AHB1FZR, DBGMCU_AHB1FZR_GPDMA_7)

#define __HAL_DBGMCU_FREEZE_GPDMA8()         SET_BIT(DBGMCU->AHB1FZR, DBGMCU_AHB1FZR_GPDMA_8)
#define __HAL_DBGMCU_UNFREEZE_GPDMA8()       CLEAR_BIT(DBGMCU->AHB1FZR, DBGMCU_AHB1FZR_GPDMA_8)

#define __HAL_DBGMCU_FREEZE_GPDMA9()         SET_BIT(DBGMCU->AHB1FZR, DBGMCU_AHB1FZR_GPDMA_9)
#define __HAL_DBGMCU_UNFREEZE_GPDMA9()       CLEAR_BIT(DBGMCU->AHB1FZR, DBGMCU_AHB1FZR_GPDMA_9)

#define __HAL_DBGMCU_FREEZE_GPDMA10()        SET_BIT(DBGMCU->AHB1FZR, DBGMCU_AHB1FZR_GPDMA_10)
#define __HAL_DBGMCU_UNFREEZE_GPDMA10()      CLEAR_BIT(DBGMCU->AHB1FZR, DBGMCU_AHB1FZR_GPDMA_10)

#define __HAL_DBGMCU_FREEZE_GPDMA11()        SET_BIT(DBGMCU->AHB1FZR, DBGMCU_AHB1FZR_GPDMA_11)
#define __HAL_DBGMCU_UNFREEZE_GPDMA11()      CLEAR_BIT(DBGMCU->AHB1FZR, DBGMCU_AHB1FZR_GPDMA_11)

