RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal.h
#define IS_SBS_EXTI_PIN(__PIN__)                 (((__PIN__) == SBS_EXTI_PIN_PORTA) || \
                                                  ((__PIN__) == SBS_EXTI_PIN_PORTB) || \
                                                  ((__PIN__) == SBS_EXTI_PIN_PORTC) || \
                                                  ((__PIN__) == SBS_EXTI_PIN_PORTD) || \
                                                  ((__PIN__) == SBS_EXTI_PIN_PORTE) || \
                                                  ((__PIN__) == SBS_EXTI_PIN_PORTF) || \
                                                  ((__PIN__) == SBS_EXTI_PIN_PORTG) || \
                                                  ((__PIN__) == SBS_EXTI_PIN_PORTH) || \
                                                  ((__PIN__) == SBS_EXTI_PIN_PORTM) || \
                                                  ((__PIN__) == SBS_EXTI_PIN_PORTN) || \
                                                  ((__PIN__) == SBS_EXTI_PIN_PORTO) || \
                                                  ((__PIN__) == SBS_EXTI_PIN_PORTP))
/**
  * @}
  */

/** @addtogroup AXIM_Private_Macros
  * @{
  */
#define IS_AXIM_ASIB_READ_ISS(__ISS__)          (((__ISS__) == AXIM_ASIB_READ_ISS_NORMAL) || \
                                                 ((__ISS__) == AXIM_ASIB_READ_ISS_FORCE_TO_1))

#define IS_AXIM_ASIB_WRITE_ISS(__ISS__)         (((__ISS__) == AXIM_ASIB_WRITE_ISS_NORMAL) || \
                                                 ((__ISS__) == AXIM_ASIB_WRITE_ISS_FORCE_TO_1))

#define IS_AXIM_QOS(__QOS__)                    ((__QOS__) <= AXIM_ASIB_READQOS_AR_QOS)

#define IS_AXIM_AMIB_READ_ISS(__ISS__)          (((__ISS__) == AXIM_AMIB_READ_ISS_NORMAL) || \
                                                 ((__ISS__) == AXIM_AMIB_READ_ISS_FORCE_TO_1))

#define IS_AXIM_AMIB_WRITE_ISS(__ISS__)         (((__ISS__) == AXIM_AMIB_WRITE_ISS_NORMAL) || \
                                                 ((__ISS__) == AXIM_AMIB_WRITE_ISS_FORCE_TO_1))

#define IS_AXIM_AMIB_READ_ISS_BM(__ISS__)       (((__ISS__) == AXIM_AMIB_READ_ISS_NORMAL) || \
                                                 ((__ISS__) == AXIM_AMIB_READ_ISS_FORCE_TO_1))

#define IS_AXIM_AMIB_WRITE_ISS_BM(__ISS__)      (((__ISS__) == AXIM_AMIB_WRITE_ISS_BM_NORMAL) || \
                                                 ((__ISS__) == AXIM_AMIB_WRITE_ISS_BM_FORCE_TO_1))

/**
  * @}
  */

/* Exported variables --------------------------------------------------------*/

/** @addtogroup HAL_Exported_Variables
  * @{
  */
extern __IO uint32_t        uwTick;
extern uint32_t             uwTickPrio;
extern HAL_TickFreqTypeDef  uwTickFreq;
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/

/** @addtogroup HAL_Exported_Functions
  * @{
  */

/** @addtogroup HAL_Exported_Functions_Group1
  * @{
  */

/* Initialization and de-initialization functions  ****************************/
HAL_StatusTypeDef    HAL_Init(void);
HAL_StatusTypeDef    HAL_DeInit(void);
void                 HAL_MspInit(void);
void                 HAL_MspDeInit(void);
HAL_StatusTypeDef    HAL_InitTick(uint32_t TickPriority);

/**
  * @}
  */

/** @addtogroup HAL_Exported_Functions_Group2
  * @{
  */

/* Peripheral Control functions  **********************************************/
void                 HAL_IncTick(void);
void                 HAL_Delay(uint32_t Delay);
uint32_t             HAL_GetTick(void);
uint32_t             HAL_GetTickPrio(void);
HAL_StatusTypeDef    HAL_SetTickFreq(HAL_TickFreqTypeDef Freq);
HAL_TickFreqTypeDef  HAL_GetTickFreq(void);
void                 HAL_SuspendTick(void);
void                 HAL_ResumeTick(void);
uint32_t             HAL_GetHalVersion(void);
uint32_t             HAL_GetREVID(void);
uint32_t             HAL_GetDEVID(void);
uint32_t             HAL_GetUIDw0(void);
uint32_t             HAL_GetUIDw1(void);
uint32_t             HAL_GetUIDw2(void);

/**
  * @}
  */

/** @addtogroup HAL_Exported_Functions_Group3
  * @{
  */

/* DBGMCU Peripheral Control functions  ***************************************/
void                 HAL_DBGMCU_EnableDBGSleepMode(void);
void                 HAL_DBGMCU_DisableDBGSleepMode(void);
void                 HAL_DBGMCU_EnableDBGStopMode(void);
void                 HAL_DBGMCU_DisableDBGStopMode(void);
void                 HAL_DBGMCU_EnableDBGStandbyMode(void);
void                 HAL_DBGMCU_DisableDBGStandbyMode(void);

/**
  * @}
  */

/** @addtogroup HAL_Exported_Functions_Group4
  * @{
  */

/* SBS Control functions  *****************************************************/
uint32_t             HAL_SBS_GetBootAddress(void);

void                 HAL_SBS_IncrementHDPLValue(void);
uint32_t             HAL_SBS_GetHDPLValue(void);

void                 HAL_SBS_OpenAccessPort(void);
void                 HAL_SBS_OpenDebug(void);
HAL_StatusTypeDef    HAL_SBS_ConfigDebugLevel(uint32_t Level);
uint32_t             HAL_SBS_GetDebugLevel(void);
void                 HAL_SBS_UnlockDebugConfig(void);
void                 HAL_SBS_LockDebugConfig(void);

void                 HAL_SBS_ConfigRSSCommand(uint32_t Cmd);
uint32_t             HAL_SBS_GetRSSCommand(void);

void                 HAL_SBS_EnableIOAnalogBooster(void);
void                 HAL_SBS_DisableIOAnalogBooster(void);
void                 HAL_SBS_EnableIOAnalogSwitchVdd(void);
void                 HAL_SBS_DisableIOAnalogSwitchVdd(void);
void                 HAL_SBS_ConfigEthernetPHY(uint32_t Config);
void                 HAL_SBS_ConfigAXISRAMWaitState(uint32_t Config);

void                 HAL_SBS_EnableCompensationCell(uint32_t Selection);
void                 HAL_SBS_DisableCompensationCell(uint32_t Selection);
uint32_t             HAL_SBS_GetCompensationCellReadyStatus(uint32_t Selection);
void                 HAL_SBS_ConfigCompensationCell(uint32_t Selection, uint32_t Code, uint32_t NmosValue,
                                                    uint32_t PmosValue);
HAL_StatusTypeDef    HAL_SBS_GetCompensationCell(uint32_t Selection, uint32_t *pCode, uint32_t *pNmosValue,
                                                 uint32_t *pPmosValue);

void                 HAL_SBS_EnableIOSpeedOptimize(uint32_t Selection);
void                 HAL_SBS_DisableIOSpeedOptimize(uint32_t Selection);

void                 HAL_SBS_ConfigTimerBreakInput(uint32_t Input);
uint32_t             HAL_SBS_GetTimerBreakInputConfig(void);

void                 HAL_SBS_EXTIConfig(uint32_t Exti, uint32_t Port);
uint32_t             HAL_SBS_GetEXTIConfig(uint32_t Exti);
/**
  * @}
  */

/** @addtogroup HAL_Exported_Functions_Group5
  * @{
  */

/* VREFBUF Control functions  *************************************************/
void                 HAL_VREFBUF_VoltageScalingConfig(uint32_t VoltageScaling);
void                 HAL_VREFBUF_HighImpedanceConfig(uint32_t Mode);
void                 HAL_VREFBUF_TrimmingConfig(uint32_t TrimmingValue);
HAL_StatusTypeDef    HAL_VREFBUF_Enable(void);
void                 HAL_VREFBUF_Disable(void);


/**
  * @}
  */

/** @addtogroup HAL_Exported_Functions_Group6
  * @{
  */

/* AXIM Configuration functions  *************************************************/
void                 HAL_AXIM_ASIB_EnablePacking(AXIM_ASIB_TypeDef *AsibInstance);
void                 HAL_AXIM_ASIB_DisablePacking(AXIM_ASIB_TypeDef *AsibInstance);
void                 HAL_AXIM_ASIB_IssuingConfig(AXIM_ASIB_TypeDef *AsibInstance, uint32_t ReadIssuing,
                                                 uint32_t WriteIssuing);
void                 HAL_AXIM_ASIB_ReadQoSConfig(AXIM_ASIB_TypeDef *AsibInstance, uint32_t QosPriority);
void                 HAL_AXIM_ASIB_WriteQoSConfig(AXIM_ASIB_TypeDef *AsibInstance, uint32_t QosPriority);


void                 HAL_AXIM_AMIB_EnablePacking(AXIM_AMIB_TypeDef *AmibInstance);
void                 HAL_AXIM_AMIB_DisablePacking(AXIM_AMIB_TypeDef *AmibInstance);
void                 HAL_AXIM_AMIB_IssuingConfig(AXIM_AMIB_TypeDef *AmibInstance, uint32_t ReadIssuing,
                                                 uint32_t WriteIssuing);
void                 HAL_AXIM_AMIB_IssuingConfigBusMatrix(AXIM_AMIB_TypeDef *AmibInstance, uint32_t ReadIssuing,
                                                          uint32_t WriteIssuing);
void                 HAL_AXIM_AMIB_EnableLongBurst(AXIM_AMIB_TypeDef *AmibInstance);
void                 HAL_AXIM_AMIB_DisableLongBurst(AXIM_AMIB_TypeDef *AmibInstance);
/**
  * @}
  */

/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32H7RSxx_HAL_H */
